Revit 2027 API
ComboBoxMemberData Constructor
Constructs a new instance of ComboBoxMemberData.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ComboBoxMemberData(
	string name,
	string text
)
Public Sub New (
	name As String,
	text As String
)
public:
ComboBoxMemberData(
	String^ name,
	String^ text
)
new :
        name : string *
        text : string -> ComboBoxMemberData
Parameters
name String
The internal name of the ComboBoxMember.
text String
The user visible text seen on the item.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when null is passed for one or more arguments.
ArgumentException | Thrown when an empty string is passed for one or more arguments.
See Also
Reference
ComboBoxMemberData Class
Autodesk.Revit.UI Namespace